IDENTIFICATION DIVISION.
PROGRAM-ID. WRITE-ERROR.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT ERROR-FILE ASSIGN TO "nohup.out"
            ORGANIZATION IS LINE SEQUENTIAL
            ACCESS MODE IS SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
    FD ERROR-FILE.
        01 ERROR-DETAILS.
            05 ERROR-TYPE   PIC A(17).
            05 CUSTOMER-ID  PIC 9(10).
            05 PRODUCT-ID   PIC 9(11).
            05 ORDERED      PIC 9(6).
        
    LINKAGE SECTION.
        01 ETPYE        PIC A(17).
        01 CID          PIC 9(10).
        01 PID          PIC 9(11).
        01 NUM-ORDERED  PIC 9(6).

PROCEDURE DIVISION USING ETPYE, CID, PID, NUM-ORDERED.

000-MAIN.
    OPEN EXTEND ERROR-FILE.

    PERFORM 100-BUILD-ERROR.

    WRITE ERROR-DETAILS.
    CLOSE ERROR-FILE.

    GOBACK.

100-BUILD-ERROR.
    MOVE ETPYE TO ERROR-TYPE.
    MOVE CID TO CUSTOMER-ID.
    MOVE PID TO PRODUCT-ID.
    MOVE NUM-ORDERED TO ORDERED.
    *> DISPLAY NUM-ORDERED.