IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 READ-FILE    PIC X(14) VALUE "READ-CUSTOMERS".
    01 CUSTOMER-TABLE.
        05 CUSTOMER                 OCCURS 10 TIMES INDEXED BY I.
            10 CUSTOMER-NUMBER      PIC 9(10).
            10 CUSTOMER-NAME        PIC A(23).
            10 CUSTOMER-ADDRESS     PIC X(23).
            10 CUSTOMER-CITY        PIC A(13).
            10 CUSTOMER-STATE       PIC A(12).
            10 CUSTOMER-OWES        PIC S9(3)V9(2).

 PROCEDURE DIVISION.
 000-MAIN.
    CALL READ-FILE USING CUSTOMER-TABLE.
    SET I TO 1.
    PERFORM 100-PRINT-TABLE UNTIL I > 10.
    STOP RUN.

100-PRINT-TABLE.
    DISPLAY CUSTOMER(I).
    ADD 1 TO I.

