IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 READ-CUSTOMERS        PIC X(14) VALUE "READ-CUSTOMERS".
    01 READ-INVENTORY        PIC X(14) VALUE "READ-INVENTORY".

    01 CUSTOMER-TABLE.
        05 CUSTOMER                 OCCURS 10 TIMES INDEXED BY I.
            10 CUSTOMER-NUMBER      PIC 9(10).
            10 CUSTOMER-NAME        PIC A(23).
            10 CUSTOMER-ADDRESS     PIC X(23).
            10 CUSTOMER-CITY        PIC A(13).
            10 CUSTOMER-STATE       PIC A(12).
            10 CUSTOMER-OWES        PIC S9(3)V9(2).

    01 INVENTORY-TABLE.
        05 INVENTORY        OCCURS 24 TIMES INDEXED BY J.
            10 PRODUCT-NUMBER       PIC 9(11).
            10 PRODUCT-NAME         PIC X(25).
            10 PRODUCT-IN-STOCK     PIC 9(7).
            10 PRODUCT-MIN-STOCK    PIC 9(7).
            10 PRODUCT-PRICE        PIC S9(2)V9(2).

 PROCEDURE DIVISION.
 000-MAIN.
    CALL READ-CUSTOMERS USING CUSTOMER-TABLE.
    CALL READ-INVENTORY USING INVENTORY-TABLE.
    SET I TO 1.
    PERFORM 100-PRINT-CUSTOMERS UNTIL I > 10.
    DISPLAY "-------------------------------------------------".
    SET J TO 1.
    PERFORM 200-PRINT-INVENTORY UNTIL J > 24.
    STOP RUN.

100-PRINT-CUSTOMERS.
    DISPLAY CUSTOMER(I).
    ADD 1 TO I.

200-PRINT-INVENTORY.
    DISPLAY INVENTORY(J).
    ADD 1 TO J.
    